In [81]:
import numpy as np
import pandas as pd

In [82]:
#// SERIES

labels =['a','b','c']
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {1:10,2:10,3:30}
pd.Series(my_list)

0    10
1    20
2    30
dtype: int64

In [83]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [84]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [85]:
pd.Series(d)

1    10
2    10
3    30
dtype: int64

In [86]:
#//DATA-FRAMES

data = {
    'NAME' : ['John','Anna','Peter','Linda'],
    'AGE' : [28,34,29,42],
    'CITY' : ['New York','Paris','Berlin','London'],
    'SALARY' : [65000,70000,62000,85000]
}

df = pd.DataFrame(data)
df

    NAME  AGE      CITY  SALARY
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [87]:
data_list = [['John',28,'New York',65000],
            ['Anna',34,'Paris',70000],
            ['Petter',29,'Berlin',62000],
            ['Linda',42,'London',85000]]
df = pd.DataFrame(data_list)
df

        0   1         2      3
0    John  28  New York  65000
1    Anna  34     Paris  70000
2  Petter  29    Berlin  62000
3   Linda  42    London  85000

In [88]:
columns = ["NAME","AGE","CITY","SALARY"]
df2 = pd.DataFrame(data_list,columns=columns) #// ADD A ROW WITH COLUMNNS / LABELS FOR EACH COLUMNS
df2

     NAME  AGE      CITY  SALARY
0    John   28  New York   65000
1    Anna   34     Paris   70000
2  Petter   29    Berlin   62000
3   Linda   42    London   85000

In [89]:
df2[["NAME","CITY"]] #// SELECTING AND INDEXING COLUMNS

     NAME      CITY
0    John  New York
1    Anna     Paris
2  Petter    Berlin
3   Linda    London

In [90]:
df2["DESIGNATION"] = ["Doctor","English","Doctor","Civics"] #// ADD A NEW COLUMN
df2

     NAME  AGE      CITY  SALARY DESIGNATION
0    John   28  New York   65000      Doctor
1    Anna   34     Paris   70000     English
2  Petter   29    Berlin   62000      Doctor
3   Linda   42    London   85000      Civics

In [ ]:
df2.drop('DESIGNATION',axis = 1) #// REMOVES COLUMN

     NAME  AGE      CITY  SALARY
0    John   28  New York   65000
1    Anna   34     Paris   70000
2  Petter   29    Berlin   62000
3   Linda   42    London   85000

In [ ]:
df.loc[[1,3]] #// [YE WALA , OR YE WALA] , sirf vo rows jinke index likhe hain

       0   1       2      3
1   Anna  34   Paris  70000
3  Linda  42  London  85000

In [99]:
df.iloc[3] #// GIVES DATA OF A ROW

0     Linda
1        42
2    London
3     85000
Name: 3, dtype: object

In [100]:
df.loc[0,1],["CITY","SALARY"] #// SLICING SUBSET OF ROWS AND COLUMNS

(np.int64(28), ['CITY', 'SALARY'])

In [101]:
data2 = {
            'A' : [1,2,np.nan,4,5],
            'B' : [np.nan,2,3,4,5],
            'C' : [1,2,3,np.nan,np.nan],
            'D' : [1,np.nan,np.nan,np.nan,5]
}

df3 = pd.DataFrame(data2)
df3

     A    B    C    D
0  1.0  NaN  1.0  1.0
1  2.0  2.0  2.0  NaN
2  NaN  3.0  3.0  NaN
3  4.0  4.0  NaN  NaN
4  5.0  5.0  NaN  5.0

In [102]:
df3.isna() #// TELLS THAT A PARTICULAR POSITION IN A COLUMN IS EMPTY OR NOT

       A      B      C      D
0  False   True  False  False
1  False  False  False   True
2   True  False  False   True
3  False  False   True   True
4  False  False   True  False

In [103]:
df3.isna().sum() #// TELLS HOW NAMY EMPTY VALUES ARE THERE IN A COLUMN

A    1
B    1
C    2
D    3
dtype: int64

In [104]:
df3.sum().any() #// TO CHECK IF ANY OF THE ROW HAS ONE OR MORE THAN ONE EMPTY POSITION

np.True_

In [ ]:
#// Pull Sucessfully